Revit 2026 API

# GlobalParametersManagerGetAllGlobalParameters Method

---

Returns all global parameters available in the given document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<ElementId> GetAllGlobalParameters(
	Document document
)
```
```vb
Public Shared Function GetAllGlobalParameters (
	document As Document
) As ISet(Of ElementId)
```
```cpp
public:
static ISet<ElementId^>^ GetAllGlobalParameters(
	Document^ document
)
```
```fsharp
static member GetAllGlobalParameters :
        document : Document -> ISet<ElementId>
```

#### Parameters

document Document
     The document containing the global parameters

#### Return Value

ISetElementId A collection of Element Ids of global parameter elements.

| Exception | Condition |
| --- | --- |
| ArgumentException | Global parameters are not supported in the given document. A possible cause is that it is not a project document, for global parameters are not supported in Revit families. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

GlobalParametersManager Class

Autodesk.Revit.DB Namespace